Autodesk.Revit.DB.Fabrication.ValidationStatus
Lists the validation type of the fabrication part.
Since:
2016
Since:
2016

Autodesk.Revit.DB.Fabrication.ValidationStatus.NoMaterial
The part has no material being specified.

Autodesk.Revit.DB.Fabrication.ValidationStatus.InvalidDimensions
The part has invalid dimensions.

Autodesk.Revit.DB.Fabrication.ValidationStatus.Valid
The part is valid to fabrication.